# Value Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetPropertyTime..::..Value Property
AssetPropertyTime Class See Also
---
Get the value of the property
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DateTime Value { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Value As DateTime
	Get
```

Visual C++
---
```text
public:
property DateTime Value {
	DateTime get ();
}
```

# See Also
AssetPropertyTime Class
Autodesk.Revit.DB.Visual Namespace